//<LSTPRF> JOB ACCT#,REGION=0M,CLASS=A
//RPT     EXEC PGM=IN25UTIL,REGION=2M
//STEPLIB   DD DISP=SHR,DSN=PRODUCT.INTERTST.LOADLIB
//          DD DISP=SHR,DSN=PRODUCT.INTERTST.R11J.CAVHLOAD
//          DD DISP=SHR,DSN=PRODUCT.INTERTST.CAVHLOAD
//PROTSYM   DD DISP=SHR,DSN=&SYSUID..PUBLIC.PROTSYM
//OUTPUT    DD SYSOUT=*,DCB=(LRECL=133,BLKSIZE=3990)
//MESSAGE   DD SYSOUT=*
//CARDS     DD *
REPORT
/*
