//<RUNDOG>  JOB ACCT#,REGION=0M,CLASS=A
//RUN      EXEC PGM=DOGGOS
//STEPLIB    DD DISP=SHR,DSN=&SYSUID..PUBLIC.LOADLIB
//ADOPTS     DD DISP=SHR,DSN=&SYSUID..PUBLIC.INPUT
//OUTREP     DD SYSOUT=*
//SYSOUT     DD SYSOUT=*
//* ----------- FOR SYMDUMP TO CAMPTURE DUMP
//SYSUDUMP   DD SYSOUT=*
//CAISYM     DD DISP=SHR,DSN=&SYSUID..PUBLIC.PROTSYM
//CAIPRTLB   DD DISP=SHR,DSN=PRODUCT.INTERTST.PRTLIB
//CAIPRINT   DD SYSOUT=*
//CAIOPTS    DD *
PRTREPT BOTH
/*
//CEEOPTS    DD *
TRAP(OFF)
/*
