      * INTERNAL TIMESTAMP REPRESENTATION WITHIN THE DOGGOS PROGRAM             
       01 CURR-DATE.                                                            
           05 CURR-MONTH PIC 9(2).                                              
           05 CURR-DAY PIC 9(2).                                                
