      * INPUT RECORD STRUCTURE FOR EACH PARTICULAR ADOPTION                     
       01  ADOPTED-DOGS-REC.                                                    
           05 INP-DOG-BREED              PIC X(30).                             
           05 FILLER                     PIC X(25).                             
           05 INP-ADOPTED-AMOUNT         PIC 9(3).                              
           05 FILLER                     PIC X(21).                             
