       IDENTIFICATION DIVISION.
       PROGRAM-ID. DOGGOS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ADOPTS-INPUT ASSIGN ADOPTS
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL
           FILE STATUS IS ADOPTIONS-FS.
           SELECT ADOPTS-REPORT ASSIGN OUTREP
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL
           FILE STATUS IS ADOPTIONS-FS.
       DATA DIVISION.
       FILE SECTION.
       FD ADOPTS-INPUT
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS ADOPTED-DOGS-REC.
      * INPUT RECORD FORMAT
       COPY DOGADOPT.
       FD ADOPTS-REPORT
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS ADOPTED-REPORT-REC.
      * OUTPUT RECORD FORMAT
       COPY ADOPTRPT.
       WORKING-STORAGE SECTION.
      * INPUT RECORDS FILE STATUS
       01  ADOPTIONS-FS PIC 9(2).
       01  END-OF-INPUT PIC 9(1) VALUE 0.
       01  END-OF-FILE  PIC 9(1) VALUE 1.
      * OUTPUT REPORT FILE STATUS
       01  ADOPT-REPORT-FS PIC 9(2).
       COPY DATETIME.
      * INTERNAL ACCUMULATOR FOR EACH BREED
       01 BREED-INDEXES.
           05 SHIBA-INDEX.
               10 SHIBA-INDEX-VALUE  PIC 9(1) VALUE 1.
               10 SHIBA-BREED-NAME PIC X(5) VALUE 'SHIBA'.
           05 SHNAUTZER-INDEX.
               10 SHNAUTZER-INDEX-VALUE  PIC 9(1) VALUE 2.
               10 SHNAUTZER-BREED-NAME PIC X(9) VALUE 'SHNAUTZER'.
           05 KORGI-INDEX.
               10 KORGI-INDEX-VALUE  PIC 9(1) VALUE 3.
               10 KORGI-BREED-NAME PIC X(5) VALUE 'KORGI'.
           05 CHI-INDEX.
               10 CHI-INDEX-VALUE  PIC 9(1) VALUE 4.
               10 CHI-BREED-NAME PIC X(3) VALUE 'CHI'.
           05 POODLE-INDEX.
               10 POODLE-INDEX-VALUE PIC 9(1) VALUE 5.
               10 POODLE-BREED-NAME PIC X(6) VALUE 'POODLE'.
           05 POMERANIAN-INDEX.
               10 POMERANIAN-INDEX-VALUE PIC 9(1) VALUE 6.
               10 POMERANIAN-BREED-NAME PIC X(10) VALUE 'POMERANIAN'.
           05 BULDOG-INDEX.
               10 BULDOG-INDEX-VALUE PIC 9(1) VALUE 7.
               10 BULDOG-BREED-NAME PIC X(6) VALUE 'BULDOG'.
           05 JINGO-INDEX.
               10 JINGO-INDEX-VALUE PIC 9(1) VALUE 8.
               10 JINGO-BREED-NAME PIC X(5) VALUE 'JINGO'.
           05 OTHER-INDEX.
               10 OTHER-INDEX-VALUE  PIC 9(1) VALUE 9.
               10 OTHER-BREED-NAME PIC X(5) VALUE 'OTHER'.
      * INTERNAL DATA STRUCTURE TO KEEP
      * THE AMOUNT OF ADOPTIONS PER BREED
       01 ACCUMULATOR.
           05 BREED-ADOPTIONS PIC 9(3) OCCURS 9 TIMES VALUE 000.
      * FINAL DATA STRUCTURE TO FLUSH THE ADOPTIONS IN THE PARTICULAR
      * BREED INTO THE REPORT
       01  ADOPTED-RESULT.
           05 FILLER                 PIC X(6) VALUE "BREED ".
           05 DOG-BREED              PIC X(30).
           05 FILLER                 PIC X(13) VALUE " WAS ADOPTED ".
           05 ADOPTED-AMOUNT         PIC 9(3).
           05 FILLER                 PIC X(11) VALUE " TIMES PER ".
           05 REPORT-PERIOD.
               10 REPORT-TIME        PIC 9(2).
               10 FILLER                 PIC X(1) VALUE " ".
               10 PERIOD-NAME        PIC X(10).
           05 FILLER                 PIC X(4).

       PROCEDURE DIVISION.
           PERFORM PRINT-WELCOME.
           PERFORM OPEN-INPUT.
           PERFORM OPEN-OUTPUT.
      * READ THE INPUT UNTIL THE END AND UPDATE INTERNAL DATA STRUCTURE
           PERFORM READ-ADOPTION.
           PERFORM UNTIL END-OF-INPUT IS EQUAL TO END-OF-FILE
                PERFORM UPDATE-ACCUMULATOR
                PERFORM READ-ADOPTION
           END-PERFORM.

           MOVE 'DAY' TO PERIOD-NAME.
           MOVE 1 TO REPORT-TIME.

      * WRITE EACH BREED RESULTS INTO THE FINAL REPORT
           MOVE SHIBA-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(SHIBA-INDEX-VALUE) TO ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           MOVE SHNAUTZER-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(SHNAUTZER-INDEX-VALUE)
                     TO ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           MOVE KORGI-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(KORGI-INDEX-VALUE) TO ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           MOVE CHI-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(CHI-INDEX-VALUE) TO ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           MOVE POODLE-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(POODLE-INDEX-VALUE) TO ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           MOVE POMERANIAN-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(POMERANIAN-INDEX-VALUE) TO
                ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           MOVE BULDOG-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(BULDOG-INDEX-VALUE) TO
                ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           MOVE JINGO-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(JINGO-INDEX-VALUE) TO ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           MOVE OTHER-BREED-NAME TO DOG-BREED.
           MOVE BREED-ADOPTIONS(OTHER-INDEX-VALUE) TO ADOPTED-AMOUNT.
           MOVE ADOPTED-RESULT TO ADOPTED-REPORT-REC.
           PERFORM WRITE-ADOPTION-BREED-REPORT.

           PERFORM CLOSE-INPUT.
           PERFORM CLOSE-OUTPUT.

           STOP RUN.

       PRINT-WELCOME.
           DISPLAY "THIS PROGRAM WILL CALCULATE AMOUNT"
                    " OF ADOPTED DOGGOS PER SOME PERIODS OF TIME".
           MOVE FUNCTION CURRENT-DATE TO CURR-DATE.
           DISPLAY "TODAY IS :" CURR-DATE.

       OPEN-INPUT.
           OPEN INPUT ADOPTS-INPUT.
           IF ADOPTIONS-FS IS EQUAL TO 35
               DISPLAY "CANNOT OPEN INPUT FILE"
               STOP RUN
           END-IF.

       OPEN-OUTPUT.
           OPEN OUTPUT ADOPTS-REPORT.
           IF ADOPT-REPORT-FS IS EQUAL TO 35
               DISPLAY "CANNOT OPEN OUTPUT FILE"
               STOP RUN
           END-IF.

       READ-ADOPTION.
           READ ADOPTS-INPUT.
           IF ADOPTIONS-FS IS EQUAL TO 10
               MOVE 1 TO END-OF-INPUT
           END-IF.
           IF ADOPTIONS-FS IS NOT EQUAL TO 00 AND NOT EQUAL TO 10
               DISPLAY "CANNOT READ RECORD PROPERLY: " ADOPTIONS-FS
               STOP RUN
           END-IF.

       UPDATE-ACCUMULATOR.
      * WHEN PARTICULAR DOG BREED COMES - UPDATE THE ACCUMULATOR FOR IT
           EVALUATE INP-DOG-BREED
                WHEN SHIBA-BREED-NAME
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(SHIBA-INDEX-VALUE)
                WHEN SHNAUTZER-BREED-NAME
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(SHNAUTZER-INDEX-VALUE)
                WHEN CHI-BREED-NAME
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(CHI-INDEX-VALUE)
                WHEN KORGI-BREED-NAME
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(KORGI-INDEX-VALUE)
                WHEN POODLE-BREED-NAME
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(POODLE-INDEX-VALUE)
                WHEN POMERANIAN-BREED-NAME
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(POMERANIAN-INDEX-VALUE)
                WHEN BULDOG-BREED-NAME
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(BULDOG-INDEX-VALUE)
                WHEN JINGO-BREED-NAME
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(JINGO-INDEX-VALUE)
                WHEN OTHER
                ADD INP-ADOPTED-AMOUNT
                    TO BREED-ADOPTIONS(OTHER-INDEX-VALUE)
           END-EVALUATE.

       WRITE-ADOPTION-BREED-REPORT.
           WRITE ADOPTED-REPORT-REC.
           IF ADOPT-REPORT-FS IS NOT EQUAL TO 00
               DISPLAY "CANNOT WRITE RECORD PROPERLY: " ADOPT-REPORT-FS
               STOP RUN
           END-IF.

       CLOSE-INPUT.
           CLOSE ADOPTS-INPUT.

       CLOSE-OUTPUT.
           CLOSE ADOPTS-REPORT.
