       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID.DOGGOS.                                                       
       DATA DIVISION.                                                           
       WORKING-STORAGE SECTION.                                                 
       PROCEDURE DIVISION.                                                      
           DISPLAY 'HELLO-WORLD'.                                               
           STOP RUN.                                                            
